; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v3 ?v8)
             (pred_8 ?v6 ?v7)
             (pred_11 ?v3 ?v7)
             (pred_7 ?v5 ?v3 )
	     (pred_4 ?v3)
             (pred_2 ?v1)
             (pred_12 ?v6)
             (pred_10 ?v7)
             (pred_6 ?v3)
             (pred_9 ?v6)
             (pred_1 ?v3)
             (pred_5 ))



(:action op_5
:parameters (?v11 ?v9 ?v13 ?v2)
:precondition (and (pred_2 ?v11) (pred_2 ?v9) (pred_12 ?v13) (pred_10 ?v2)
          (pred_3 ?v11 ?v9) (pred_8 ?v13 ?v2)
                   (pred_11 ?v9 ?v2) (pred_4 ?v11) 
                   (pred_6 ?v9) (pred_9 ?v13))
:effect (and  (pred_1 ?v9) (not (pred_6 ?v9))))


(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_2 ?v11) (pred_2 ?v4)
               (pred_4 ?v11) (pred_3 ?v11 ?v4) (pred_1 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v11))))

(:action op_3
:parameters (?v11 ?v13)
:precondition (and (pred_2 ?v11) (pred_12 ?v13) 
                  (pred_4 ?v11) (pred_7 ?v13 ?v11) (pred_5 ))
:effect (and (pred_9 ?v13)
   (not (pred_7 ?v13 ?v11)) (not (pred_5 ))))


(:action op_4
:parameters (?v11 ?v10 ?v12)
:precondition (and (pred_2 ?v11) (pred_12 ?v10) (pred_12 ?v12)
                  (pred_4 ?v11) (pred_9 ?v12) (pred_7 ?v10 ?v11))
:effect (and (pred_9 ?v10) (pred_7 ?v12 ?v11)
        (not (pred_9 ?v12)) (not (pred_7 ?v10 ?v11))))

(:action op_1
:parameters (?v11 ?v13)
:precondition (and (pred_2 ?v11) (pred_12 ?v13) 
                  (pred_4 ?v11) (pred_9 ?v13))
:effect (and (pred_5 ) (pred_7 ?v13 ?v11) (not (pred_9 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_05 obj_18 obj_11 obj_07 obj_02 obj_21 obj_08 obj_01 obj_16 obj_27 obj_24 obj_10 obj_20 obj_09 obj_04 obj_26 obj_22 obj_13 obj_12 obj_17 obj_03 obj_25 obj_30 obj_14
    obj_15 obj_06
    obj_29 obj_23 obj_28
    )

    (:init
       (pred_5)

       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_18)
       (pred_2 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_27)
       (pred_2 obj_24)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_03)
       (pred_2 obj_25)
       (pred_2 obj_30)
       (pred_2 obj_14)
       (pred_10 obj_15)
       (pred_10 obj_06)
       (pred_12 obj_29)
       (pred_12 obj_23)
       (pred_12 obj_28)

       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_05 obj_21)
       (pred_3 obj_05 obj_18)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_05)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_02 obj_27)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_21 obj_24)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_05)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_01)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_08)
       (pred_3 obj_16 obj_09)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_01)
       (pred_3 obj_27 obj_04)
       (pred_3 obj_27 obj_24)
       (pred_3 obj_27 obj_02)
       (pred_3 obj_24 obj_26)
       (pred_3 obj_24 obj_10)
       (pred_3 obj_24 obj_21)
       (pred_3 obj_24 obj_27)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_24)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_16)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_26)
       (pred_3 obj_04 obj_27)
       (pred_3 obj_26 obj_03)
       (pred_3 obj_26 obj_22)
       (pred_3 obj_26 obj_24)
       (pred_3 obj_26 obj_04)
       (pred_3 obj_22 obj_25)
       (pred_3 obj_22 obj_13)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_22 obj_26)
       (pred_3 obj_13 obj_30)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_13 obj_22)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_03 obj_25)
       (pred_3 obj_03 obj_26)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_25 obj_30)
       (pred_3 obj_25 obj_22)
       (pred_3 obj_25 obj_03)
       (pred_3 obj_30 obj_14)
       (pred_3 obj_30 obj_13)
       (pred_3 obj_30 obj_25)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_30)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_11  obj_12 obj_15)
       (pred_11  obj_04 obj_06)
       (pred_11  obj_02 obj_06)
       (pred_1 obj_19)
       (pred_1 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_21)
       (pred_1 obj_08)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_27)
       (pred_1 obj_24)
       (pred_1 obj_10)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_26)
       (pred_1 obj_22)
       (pred_1 obj_13)
       (pred_1 obj_17)
       (pred_1 obj_03)
       (pred_1 obj_25)
       (pred_1 obj_30)
       (pred_1 obj_14)

       (pred_8  obj_29 obj_15)
       (pred_8  obj_23 obj_06)
       (pred_8  obj_28 obj_06)
       (pred_7 obj_29 obj_16)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_28 obj_17)
       (pred_4 obj_18)
    )

    (:goal (and
       (pred_7 obj_29 obj_27)
       (pred_7 obj_23 obj_26)
       (pred_7 obj_28 obj_03)
    ))
(:constraints
  (always (not (pred_4 obj_08)))
)
)

; plan
1. (op_2 obj_18 obj_05)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_05)
   goals met: 0 of 3
2. (op_2 obj_05 obj_21)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_21)
   goals met: 0 of 3
3. (op_2 obj_21 obj_24)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_24)
   goals met: 0 of 3
4. (op_2 obj_24 obj_10)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_10)
   goals met: 0 of 3
5. (op_2 obj_10 obj_20)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_20)
   goals met: 0 of 3
6. (op_2 obj_20 obj_01)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_01)
   goals met: 0 of 3
7. (op_2 obj_01 obj_16)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_16)
   goals met: 0 of 3
8. (op_3 obj_16 obj_23)
   deleted: (pred_7 obj_23 obj_16) (pred_5)
   added: (pred_9 obj_23)
   goals met: 0 of 3
9. (op_2 obj_16 obj_01)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_01)
   goals met: 0 of 3
10. (op_1 obj_01 obj_23)
   deleted: (pred_9 obj_23)
   added: (pred_5) (pred_7 obj_23 obj_01)
   goals met: 0 of 3
11. (op_2 obj_01 obj_16)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_16)
   goals met: 0 of 3
12. (op_3 obj_16 obj_29)
   deleted: (pred_7 obj_29 obj_16) (pred_5)
   added: (pred_9 obj_29)
   goals met: 0 of 3
13. (op_2 obj_16 obj_01)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_01)
   goals met: 0 of 3
14. (op_2 obj_01 obj_20)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_20)
   goals met: 0 of 3
15. (op_2 obj_20 obj_10)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_10)
   goals met: 0 of 3
16. (op_2 obj_10 obj_24)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_24)
   goals met: 0 of 3
17. (op_2 obj_24 obj_27)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_27)
   goals met: 0 of 3
18. (op_1 obj_27 obj_29)
   deleted: (pred_9 obj_29)
   added: (pred_5) (pred_7 obj_29 obj_27)
   goals met: 1 of 3
19. (op_2 obj_27 obj_24)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_24)
   goals met: 1 of 3
20. (op_2 obj_24 obj_26)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_26)
   goals met: 1 of 3
21. (op_2 obj_26 obj_22)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_22)
   goals met: 1 of 3
22. (op_2 obj_22 obj_13)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_13)
   goals met: 1 of 3
23. (op_2 obj_13 obj_20)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_20)
   goals met: 1 of 3
24. (op_2 obj_20 obj_01)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_01)
   goals met: 1 of 3
25. (op_3 obj_01 obj_23)
   deleted: (pred_7 obj_23 obj_01) (pred_5)
   added: (pred_9 obj_23)
   goals met: 1 of 3
26. (op_2 obj_01 obj_20)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_20)
   goals met: 1 of 3
27. (op_2 obj_20 obj_13)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_13)
   goals met: 1 of 3
28. (op_2 obj_13 obj_22)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_22)
   goals met: 1 of 3
29. (op_2 obj_22 obj_26)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_26)
   goals met: 1 of 3
30. (op_1 obj_26 obj_23)
   deleted: (pred_9 obj_23)
   added: (pred_5) (pred_7 obj_23 obj_26)
   goals met: 2 of 3
31. (op_2 obj_26 obj_03)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_03)
   goals met: 2 of 3
32. (op_2 obj_03 obj_17)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_17)
   goals met: 2 of 3
33. (op_3 obj_17 obj_28)
   deleted: (pred_7 obj_28 obj_17) (pred_5)
   added: (pred_9 obj_28)
   goals met: 2 of 3
34. (op_2 obj_17 obj_03)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_03)
   goals met: 2 of 3
35. (op_1 obj_03 obj_28)
   deleted: (pred_9 obj_28)
   added: (pred_5) (pred_7 obj_28 obj_03)
   goals met: 3 of 3
